tutorials/compressible/steadyCompressibleFoam/transonicBump/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // Coupled
    Up
    {
        solver BiCGStab;
        preconditioner Cholesky;

        tolerance 1e-09;
        relTol  0.0;

        minIter 1;
        maxIter 500;
    }

    // Segregated
    p
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          1000;
        tolerance        1e-8;
        relTol           0.0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter           0;
        maxIter           1000;
        tolerance        1e-8;
        relTol           0.0;
    }

    h
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter           0;
        maxIter           1000;
        tolerance        1e-8;
        relTol           0.0;
    }
}

PIMPLE
{
    nOuterCorrectors         1;
    nCorrectors              3;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    // Note: under-relaxation factors used in wave-transmissive schemes
    U               0.1;
    p               0.25;
    h               0.1;
    rho             0.5;
    T               0.5;
}

fieldBounds
{
    // With bounding
    p     5e4    3e5;
    T     230    500;
    U     500;
}

// ************************************************************************* //
